MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F5011/mcu.h
#define C2TX2B3 C2TX2B3
extern volatile uint16_t C2TX2B3 __attribute__((__sfr__));
typedef struct tagC2TX2B3BITS {
  uint16_t TXB2D40:1;
  uint16_t TXB2D41:1;
  uint16_t TXB2D42:1;
  uint16_t TXB2D43:1;
  uint16_t TXB2D44:1;
  uint16_t TXB2D45:1;
  uint16_t TXB2D46:1;
  uint16_t TXB2D47:1;
  uint16_t TXB2D50:1;
  uint16_t TXB2D51:1;
  uint16_t TXB2D52:1;
  uint16_t TXB2D53:1;
  uint16_t TXB2D54:1;
  uint16_t TXB2D55:1;
  uint16_t TXB2D56:1;
  uint16_t TXB2D57:1;
} C2TX2B3BITS;
extern volatile C2TX2B3BITS C2TX2B3bits __attribute__((__sfr__));

#define C2TX2B4 C2TX2B4
extern volatile uint16_t C2TX2B4 __attribute__((__sfr__));
typedef struct tagC2TX2B4BITS {
  uint16_t TXB2D60:1;
  uint16_t TXB2D61:1;
  uint16_t TXB2D62:1;
  uint16_t TXB2D63:1;
  uint16_t TXB2D64:1;
  uint16_t TXB2D65:1;
  uint16_t TXB2D66:1;
  uint16_t TXB2D67:1;
  uint16_t TXB2D70:1;
  uint16_t TXB2D71:1;
  uint16_t TXB2D72:1;
  uint16_t TXB2D73:1;
  uint16_t TXB2D74:1;
  uint16_t TXB2D75:1;
  uint16_t TXB2D76:1;
  uint16_t TXB2D77:1;
} C2TX2B4BITS;
extern volatile C2TX2B4BITS C2TX2B4bits __attribute__((__sfr__));

#define C2TX2CON C2TX2CON
extern volatile uint16_t C2TX2CON __attribute__((__sfr__));
__extension__ typedef struct tagC2TX2CONBITS {
  union {
    struct {
      uint16_t TXPRI:2;
      uint16_t :1;
      uint16_t TXREQ:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
    };
  };
} C2TX2CONBITS;
extern volatile C2TX2CONBITS C2TX2CONbits __attribute__((__sfr__));

#define C2TX1SID C2TX1SID
extern volatile uint16_t C2TX1SID __attribute__((__sfr__));
__extension__ typedef struct tagC2TX1SIDBITS {
  union {
    struct {
      uint16_t TXIDE:1;
      uint16_t SRR:1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t :3;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID5_0:6;
      uint16_t :3;
      uint16_t SID10_6:5;
    };
  };
} C2TX1SIDBITS;
extern volatile C2TX1SIDBITS C2TX1SIDbits __attribute__((__sfr__));

#define C2TX1EID C2TX1EID
extern volatile uint16_t C2TX1EID __attribute__((__sfr__));
__extension__ typedef struct tagC2TX1EIDBITS {
  union {
    struct {
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t :4;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
    struct {
      uint16_t EID13_6:8;
      uint16_t :4;
      uint16_t EID17_14:4;
    };
  };
} C2TX1EIDBITS;
extern volatile C2TX1EIDBITS C2TX1EIDbits __attribute__((__sfr__));

#define C2TX1DLC C2TX1DLC
extern volatile uint16_t C2TX1DLC __attribute__((__sfr__));
__extension__ typedef struct tagC2TX1DLCBITS {
  union {
    struct {
      uint16_t :3;
      uint16_t DLC:4;
      uint16_t TXRB0:1;
      uint16_t TXRB1:1;
      uint16_t TXRTR:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
    struct {
      uint16_t :3;
      uint16_t DLC0:1;
      uint16_t DLC1:1;
      uint16_t DLC2:1;
      uint16_t DLC3:1;
    };
  };
} C2TX1DLCBITS;
extern volatile C2TX1DLCBITS C2TX1DLCbits __attribute__((__sfr__));

#define C2TX1B1 C2TX1B1
extern volatile uint16_t C2TX1B1 __attribute__((__sfr__));
typedef struct tagC2TX1B1BITS {
  uint16_t TXB1D00:1;
  uint16_t TXB1D01:1;
  uint16_t TXB1D02:1;
  uint16_t TXB1D03:1;
  uint16_t TXB1D04:1;
  uint16_t TXB1D05:1;
  uint16_t TXB1D06:1;
  uint16_t TXB1D07:1;
  uint16_t TXB1D10:1;
  uint16_t TXB1D11:1;
  uint16_t TXB1D12:1;
  uint16_t TXB1D13:1;
  uint16_t TXB1D14:1;
  uint16_t TXB1D15:1;
  uint16_t TXB1D16:1;
  uint16_t TXB1D17:1;
} C2TX1B1BITS;
extern volatile C2TX1B1BITS C2TX1B1bits __attribute__((__sfr__));

#define C2TX1B2 C2TX1B2
extern volatile uint16_t C2TX1B2 __attribute__((__sfr__));
typedef struct tagC2TX1B2BITS {
  uint16_t TXB1D20:1;
  uint16_t TXB1D21:1;
  uint16_t TXB1D22:1;
  uint16_t TXB1D23:1;
  uint16_t TXB1D24:1;
  uint16_t TXB1D25:1;
  uint16_t TXB1D26:1;
  uint16_t TXB1D27:1;
  uint16_t TXB1D30:1;
  uint16_t TXB1D31:1;
  uint16_t TXB1D32:1;
  uint16_t TXB1D33:1;
  uint16_t TXB1D34:1;
  uint16_t TXB1D35:1;
  uint16_t TXB1D36:1;
  uint16_t TXB1D37:1;
} C2TX1B2BITS;
extern volatile C2TX1B2BITS C2TX1B2bits __attribute__((__sfr__));

#define C2TX1B3 C2TX1B3
extern volatile uint16_t C2TX1B3 __attribute__((__sfr__));
typedef struct tagC2TX1B3BITS {
  uint16_t TXB1D40:1;
  uint16_t TXB1D41:1;
  uint16_t TXB1D42:1;
  uint16_t TXB1D43:1;
  uint16_t TXB1D44:1;
  uint16_t TXB1D45:1;
  uint16_t TXB1D46:1;
  uint16_t TXB1D47:1;
  uint16_t TXB1D50:1;
  uint16_t TXB1D51:1;
  uint16_t TXB1D52:1;
  uint16_t TXB1D53:1;
  uint16_t TXB1D54:1;
  uint16_t TXB1D55:1;
  uint16_t TXB1D56:1;
  uint16_t TXB1D57:1;
} C2TX1B3BITS;
extern volatile C2TX1B3BITS C2TX1B3bits __attribute__((__sfr__));

#define C2TX1B4 C2TX1B4
extern volatile uint16_t C2TX1B4 __attribute__((__sfr__));
typedef struct tagC2TX1B4BITS {
  uint16_t TXB1D60:1;
  uint16_t TXB1D61:1;
  uint16_t TXB1D62:1;
  uint16_t TXB1D63:1;
  uint16_t TXB1D64:1;
  uint16_t TXB1D65:1;
  uint16_t TXB1D66:1;
  uint16_t TXB1D67:1;
  uint16_t TXB1D70:1;
  uint16_t TXB1D71:1;
  uint16_t TXB1D72:1;
  uint16_t TXB1D73:1;
  uint16_t TXB1D74:1;
  uint16_t TXB1D75:1;
  uint16_t TXB1D76:1;
  uint16_t TXB1D77:1;
} C2TX1B4BITS;
extern volatile C2TX1B4BITS C2TX1B4bits __attribute__((__sfr__));

#define C2TX1CON C2TX1CON
extern volatile uint16_t C2TX1CON __attribute__((__sfr__));
__extension__ typedef struct tagC2TX1CONBITS {
  union {
    struct {
      uint16_t TXPRI:2;
      uint16_t :1;
      uint16_t TXREQ:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
    };
  };
} C2TX1CONBITS;
