MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F5011/mcu.h
/* C2RXF4EIDL */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */

/* C2RXF5SID */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C2RXF5EIDH */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C2RXF5EIDL */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */

/* C2RXM0SID */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C2RXM0EIDH */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C2RXM0EIDL */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */

/* C2RXM1SID */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C2RXM1EIDH */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C2RXM1EIDL */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */

/* C2TX2SID */
/* Bitname _TXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SRR cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5_0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10_6 cannot be defined because it is used by more than one SFR */

/* C2TX2EID */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13_6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17_14 cannot be defined because it is used by more than one SFR */

/* C2TX2DLC */
/* Bitname _DLC cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRTR cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC1 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC2 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC3 cannot be defined because it is used by more than one SFR */

/* C2TX2B1 */
/* Bitname _TXB2D00 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D01 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D02 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D03 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D04 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D05 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D06 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D07 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D10 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D11 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D12 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D13 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D15 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D16 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D17 cannot be defined because it is used by more than one SFR */

/* C2TX2B2 */
/* Bitname _TXB2D20 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D21 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D22 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D23 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D24 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D25 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D26 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D27 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D30 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D31 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D32 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D33 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D34 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D35 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D36 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D37 cannot be defined because it is used by more than one SFR */

/* C2TX2B3 */
/* Bitname _TXB2D40 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D41 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D42 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D43 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D44 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D45 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D46 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D47 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D50 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D51 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D52 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D53 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D54 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D55 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D56 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D57 cannot be defined because it is used by more than one SFR */

/* C2TX2B4 */
/* Bitname _TXB2D60 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D61 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D62 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D63 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D64 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D65 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D66 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D67 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D70 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D71 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D72 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D73 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D74 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D75 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D76 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2D77 cannot be defined because it is used by more than one SFR */

/* C2TX2CON */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */

