MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F5011/mcu.h
#define _C2TX0DLC_EID0_POSITION                  0x0000000A
#define _C2TX0DLC_EID0_MASK                      0x00000400
#define _C2TX0DLC_EID0_LENGTH                    0x00000001

#define _C2TX0DLC_EID1_POSITION                  0x0000000B
#define _C2TX0DLC_EID1_MASK                      0x00000800
#define _C2TX0DLC_EID1_LENGTH                    0x00000001

#define _C2TX0DLC_EID2_POSITION                  0x0000000C
#define _C2TX0DLC_EID2_MASK                      0x00001000
#define _C2TX0DLC_EID2_LENGTH                    0x00000001

#define _C2TX0DLC_EID3_POSITION                  0x0000000D
#define _C2TX0DLC_EID3_MASK                      0x00002000
#define _C2TX0DLC_EID3_LENGTH                    0x00000001

#define _C2TX0DLC_EID4_POSITION                  0x0000000E
#define _C2TX0DLC_EID4_MASK                      0x00004000
#define _C2TX0DLC_EID4_LENGTH                    0x00000001

#define _C2TX0DLC_EID5_POSITION                  0x0000000F
#define _C2TX0DLC_EID5_MASK                      0x00008000
#define _C2TX0DLC_EID5_LENGTH                    0x00000001

#define _C2TX0DLC_EID5_0_POSITION                0x0000000A
#define _C2TX0DLC_EID5_0_MASK                    0x0000FC00
#define _C2TX0DLC_EID5_0_LENGTH                  0x00000006

#define _C2TX0DLC_DLC0_POSITION                  0x00000003
#define _C2TX0DLC_DLC0_MASK                      0x00000008
#define _C2TX0DLC_DLC0_LENGTH                    0x00000001

#define _C2TX0DLC_DLC1_POSITION                  0x00000004
#define _C2TX0DLC_DLC1_MASK                      0x00000010
#define _C2TX0DLC_DLC1_LENGTH                    0x00000001

#define _C2TX0DLC_DLC2_POSITION                  0x00000005
#define _C2TX0DLC_DLC2_MASK                      0x00000020
#define _C2TX0DLC_DLC2_LENGTH                    0x00000001

#define _C2TX0DLC_DLC3_POSITION                  0x00000006
#define _C2TX0DLC_DLC3_MASK                      0x00000040
#define _C2TX0DLC_DLC3_LENGTH                    0x00000001

#define _C2TX0B1_TXB0D00_POSITION                0x00000000
#define _C2TX0B1_TXB0D00_MASK                    0x00000001
#define _C2TX0B1_TXB0D00_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D01_POSITION                0x00000001
#define _C2TX0B1_TXB0D01_MASK                    0x00000002
#define _C2TX0B1_TXB0D01_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D02_POSITION                0x00000002
#define _C2TX0B1_TXB0D02_MASK                    0x00000004
#define _C2TX0B1_TXB0D02_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D03_POSITION                0x00000003
#define _C2TX0B1_TXB0D03_MASK                    0x00000008
#define _C2TX0B1_TXB0D03_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D04_POSITION                0x00000004
#define _C2TX0B1_TXB0D04_MASK                    0x00000010
#define _C2TX0B1_TXB0D04_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D05_POSITION                0x00000005
#define _C2TX0B1_TXB0D05_MASK                    0x00000020
#define _C2TX0B1_TXB0D05_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D06_POSITION                0x00000006
#define _C2TX0B1_TXB0D06_MASK                    0x00000040
#define _C2TX0B1_TXB0D06_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D07_POSITION                0x00000007
#define _C2TX0B1_TXB0D07_MASK                    0x00000080
#define _C2TX0B1_TXB0D07_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D10_POSITION                0x00000008
#define _C2TX0B1_TXB0D10_MASK                    0x00000100
#define _C2TX0B1_TXB0D10_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D11_POSITION                0x00000009
#define _C2TX0B1_TXB0D11_MASK                    0x00000200
#define _C2TX0B1_TXB0D11_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D12_POSITION                0x0000000A
#define _C2TX0B1_TXB0D12_MASK                    0x00000400
#define _C2TX0B1_TXB0D12_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D13_POSITION                0x0000000B
#define _C2TX0B1_TXB0D13_MASK                    0x00000800
#define _C2TX0B1_TXB0D13_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D14_POSITION                0x0000000C
#define _C2TX0B1_TXB0D14_MASK                    0x00001000
#define _C2TX0B1_TXB0D14_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D15_POSITION                0x0000000D
#define _C2TX0B1_TXB0D15_MASK                    0x00002000
#define _C2TX0B1_TXB0D15_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D16_POSITION                0x0000000E
#define _C2TX0B1_TXB0D16_MASK                    0x00004000
#define _C2TX0B1_TXB0D16_LENGTH                  0x00000001

#define _C2TX0B1_TXB0D17_POSITION                0x0000000F
#define _C2TX0B1_TXB0D17_MASK                    0x00008000
#define _C2TX0B1_TXB0D17_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D20_POSITION                0x00000000
#define _C2TX0B2_TXB0D20_MASK                    0x00000001
#define _C2TX0B2_TXB0D20_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D21_POSITION                0x00000001
#define _C2TX0B2_TXB0D21_MASK                    0x00000002
#define _C2TX0B2_TXB0D21_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D22_POSITION                0x00000002
#define _C2TX0B2_TXB0D22_MASK                    0x00000004
#define _C2TX0B2_TXB0D22_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D23_POSITION                0x00000003
#define _C2TX0B2_TXB0D23_MASK                    0x00000008
#define _C2TX0B2_TXB0D23_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D24_POSITION                0x00000004
#define _C2TX0B2_TXB0D24_MASK                    0x00000010
#define _C2TX0B2_TXB0D24_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D25_POSITION                0x00000005
#define _C2TX0B2_TXB0D25_MASK                    0x00000020
#define _C2TX0B2_TXB0D25_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D26_POSITION                0x00000006
#define _C2TX0B2_TXB0D26_MASK                    0x00000040
#define _C2TX0B2_TXB0D26_LENGTH                  0x00000001

#define _C2TX0B2_TXB0D27_POSITION                0x00000007
#define _C2TX0B2_TXB0D27_MASK                    0x00000080
#define _C2TX0B2_TXB0D27_LENGTH                  0x00000001

