MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F5011/mcu.h
#define _C2RX1EID_EID15_POSITION                 0x00000009
#define _C2RX1EID_EID15_MASK                     0x00000200
#define _C2RX1EID_EID15_LENGTH                   0x00000001

#define _C2RX1EID_EID16_POSITION                 0x0000000A
#define _C2RX1EID_EID16_MASK                     0x00000400
#define _C2RX1EID_EID16_LENGTH                   0x00000001

#define _C2RX1EID_EID17_POSITION                 0x0000000B
#define _C2RX1EID_EID17_MASK                     0x00000800
#define _C2RX1EID_EID17_LENGTH                   0x00000001

#define _C2RX1DLC_DLC_POSITION                   0x00000000
#define _C2RX1DLC_DLC_MASK                       0x0000000F
#define _C2RX1DLC_DLC_LENGTH                     0x00000004

#define _C2RX1DLC_RXRB0_POSITION                 0x00000004
#define _C2RX1DLC_RXRB0_MASK                     0x00000010
#define _C2RX1DLC_RXRB0_LENGTH                   0x00000001

#define _C2RX1DLC_RXRB1_POSITION                 0x00000008
#define _C2RX1DLC_RXRB1_MASK                     0x00000100
#define _C2RX1DLC_RXRB1_LENGTH                   0x00000001

#define _C2RX1DLC_RXRTR_POSITION                 0x00000009
#define _C2RX1DLC_RXRTR_MASK                     0x00000200
#define _C2RX1DLC_RXRTR_LENGTH                   0x00000001

#define _C2RX1DLC_EID0_POSITION                  0x0000000A
#define _C2RX1DLC_EID0_MASK                      0x00000400
#define _C2RX1DLC_EID0_LENGTH                    0x00000001

#define _C2RX1DLC_EID1_POSITION                  0x0000000B
#define _C2RX1DLC_EID1_MASK                      0x00000800
#define _C2RX1DLC_EID1_LENGTH                    0x00000001

#define _C2RX1DLC_EID2_POSITION                  0x0000000C
#define _C2RX1DLC_EID2_MASK                      0x00001000
#define _C2RX1DLC_EID2_LENGTH                    0x00000001

#define _C2RX1DLC_EID3_POSITION                  0x0000000D
#define _C2RX1DLC_EID3_MASK                      0x00002000
#define _C2RX1DLC_EID3_LENGTH                    0x00000001

#define _C2RX1DLC_EID4_POSITION                  0x0000000E
#define _C2RX1DLC_EID4_MASK                      0x00004000
#define _C2RX1DLC_EID4_LENGTH                    0x00000001

#define _C2RX1DLC_EID5_POSITION                  0x0000000F
#define _C2RX1DLC_EID5_MASK                      0x00008000
#define _C2RX1DLC_EID5_LENGTH                    0x00000001

#define _C2RX1DLC_EID5_0_POSITION                0x0000000A
#define _C2RX1DLC_EID5_0_MASK                    0x0000FC00
#define _C2RX1DLC_EID5_0_LENGTH                  0x00000006

#define _C2RX1DLC_DLC0_POSITION                  0x00000000
#define _C2RX1DLC_DLC0_MASK                      0x00000001
#define _C2RX1DLC_DLC0_LENGTH                    0x00000001

#define _C2RX1DLC_DLC1_POSITION                  0x00000001
#define _C2RX1DLC_DLC1_MASK                      0x00000002
#define _C2RX1DLC_DLC1_LENGTH                    0x00000001

#define _C2RX1DLC_DLC2_POSITION                  0x00000002
#define _C2RX1DLC_DLC2_MASK                      0x00000004
#define _C2RX1DLC_DLC2_LENGTH                    0x00000001

#define _C2RX1DLC_DLC3_POSITION                  0x00000003
#define _C2RX1DLC_DLC3_MASK                      0x00000008
#define _C2RX1DLC_DLC3_LENGTH                    0x00000001

#define _C2RX1B1_TXB1D00_POSITION                0x00000000
#define _C2RX1B1_TXB1D00_MASK                    0x00000001
#define _C2RX1B1_TXB1D00_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D01_POSITION                0x00000001
#define _C2RX1B1_TXB1D01_MASK                    0x00000002
#define _C2RX1B1_TXB1D01_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D02_POSITION                0x00000002
#define _C2RX1B1_TXB1D02_MASK                    0x00000004
#define _C2RX1B1_TXB1D02_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D03_POSITION                0x00000003
#define _C2RX1B1_TXB1D03_MASK                    0x00000008
#define _C2RX1B1_TXB1D03_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D04_POSITION                0x00000004
#define _C2RX1B1_TXB1D04_MASK                    0x00000010
#define _C2RX1B1_TXB1D04_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D05_POSITION                0x00000005
#define _C2RX1B1_TXB1D05_MASK                    0x00000020
#define _C2RX1B1_TXB1D05_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D06_POSITION                0x00000006
#define _C2RX1B1_TXB1D06_MASK                    0x00000040
#define _C2RX1B1_TXB1D06_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D07_POSITION                0x00000007
#define _C2RX1B1_TXB1D07_MASK                    0x00000080
#define _C2RX1B1_TXB1D07_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D10_POSITION                0x00000008
#define _C2RX1B1_TXB1D10_MASK                    0x00000100
#define _C2RX1B1_TXB1D10_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D11_POSITION                0x00000009
#define _C2RX1B1_TXB1D11_MASK                    0x00000200
#define _C2RX1B1_TXB1D11_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D12_POSITION                0x0000000A
#define _C2RX1B1_TXB1D12_MASK                    0x00000400
#define _C2RX1B1_TXB1D12_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D13_POSITION                0x0000000B
#define _C2RX1B1_TXB1D13_MASK                    0x00000800
#define _C2RX1B1_TXB1D13_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D14_POSITION                0x0000000C
#define _C2RX1B1_TXB1D14_MASK                    0x00001000
#define _C2RX1B1_TXB1D14_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D15_POSITION                0x0000000D
#define _C2RX1B1_TXB1D15_MASK                    0x00002000
#define _C2RX1B1_TXB1D15_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D16_POSITION                0x0000000E
#define _C2RX1B1_TXB1D16_MASK                    0x00004000
#define _C2RX1B1_TXB1D16_LENGTH                  0x00000001

#define _C2RX1B1_TXB1D17_POSITION                0x0000000F
#define _C2RX1B1_TXB1D17_MASK                    0x00008000
#define _C2RX1B1_TXB1D17_LENGTH                  0x00000001

#define _C2RX1B2_TXB1D20_POSITION                0x00000000
#define _C2RX1B2_TXB1D20_MASK                    0x00000001
#define _C2RX1B2_TXB1D20_LENGTH                  0x00000001

